# YOLOv9m + CBAM Attention
# CBAM (Convolutional Block Attention Module) adds channel + spatial attention
# Helps model focus on maize plants vs background vegetation
# Expected improvement: +3-8% mAP on agricultural imagery

# Model parameters
nc: 1          # single class: Maize
scales:
  m: [0.75, 0.75, 768]

# Backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]          # 0 - P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1 - P2/4
  - [-1, 3, C2f, [128, True]]          # 2
  - [-1, 1, Conv, [256, 3, 2]]         # 3 - P3/8
  - [-1, 6, C2f, [256, True]]          # 4
  - [-1, 1, CBAM, [256]]               # 5 - CBAM attention on P3
  - [-1, 1, Conv, [512, 3, 2]]         # 6 - P4/16
  - [-1, 6, C2f, [512, True]]          # 7
  - [-1, 1, CBAM, [512]]               # 8 - CBAM attention on P4
  - [-1, 1, Conv, [512, 3, 2]]         # 9 - P5/32
  - [-1, 3, C2f, [512, True]]          # 10
  - [-1, 1, CBAM, [512]]               # 11 - CBAM attention on P5
  - [-1, 1, SPPF, [512, 5]]            # 12

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 13
  - [[-1, 8], 1, Concat, [1]]                     # 14 cat with P4
  - [-1, 3, C2f, [512]]                           # 15

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 16
  - [[-1, 5], 1, Concat, [1]]                     # 17 cat with P3
  - [-1, 3, C2f, [256]]                           # 18 - P3/8 out

  - [-1, 1, Conv, [256, 3, 2]]                    # 19
  - [[-1, 15], 1, Concat, [1]]                    # 20 cat with head P4
  - [-1, 3, C2f, [512]]                           # 21 - P4/16 out

  - [-1, 1, Conv, [512, 3, 2]]                    # 22
  - [[-1, 12], 1, Concat, [1]]                    # 23 cat with head P5
  - [-1, 3, C2f, [512]]                           # 24 - P5/32 out

  - [[18, 21, 24], 1, Detect, [nc]]               # 25 Detect(P3, P4, P5)
